# PostgreSQL NOTES

These are notes on SQL syntax. While these notes focus on syntax with PostgreSQL, the idea of the querying syntax may apply to other SQL languages. For example, MySQL is almost identical to PostgreSQL in terms of syntax, with the exception of a couple of minor points (of course).

## Sample Datasets to Work with

As an initial matter, we can use [this SQL IDE](https://www.db-fiddle.com/) for playing around with SQL datasets.

[Sample Dataset 1: Novels](https://raw.githubusercontent.com/ephs08kmp/sql_workshop_schema/master/sql_example.txt) <br>
[Sample Dataset 2: Train Stations](https://raw.githubusercontent.com/ephs08kmp/sql_workshop_schema/master/sql_workshop.txt)
***
### Good Practice

One cannot say that s/he is "proficient" at PostgreSQL without [completing these exercises in full!](https://pgexercises.com/)

# I. LOADING DATA INTO PostgreSQL

Three main ways:
1. Load data into a database from a _.sql file_.
    - The one that will be referred to in these notes is the open-source __PgAdmin4__
2. Load data into a database from a different tabular file, such as a _.csv file_.
3. Create the table parameters manually within the database.

##  A. NORMAL LOADING FROM .sql FILE

_How to do in __PgAdmin__:_

1. (Right click on) Database - Create -> Database
2. (Right click on) (Newly Created Database) - Query Tool...
3. On the query tool toolbar, open file

### What is a 'Database File' and What is a 'Query Tool'?

- __Database File__ = folder containing all relevant \*\*\*\*\*\*.sql\*\*\*\*\*\* files
<br>
- __Query Tool__ = A tool used to 'query' information from files - the main thing of SQL (see below section)

***

## B. IMPORT DATA FROM .csv FILE - HOW-TO!

__Two Main ways to import data from non-.sql files: via (a) the Query Tool or via (b) the database program itself.__ <br><br>

a. __Create Table manually under Query Tool:__
<br><br>
   - `CREATE TABLE` (follow Create Table syntax above, i.e., listing column name and type)
   - Populating the newly created table via the query tool requires:
      ```SQL
      COPY table_name(column_name1, column_name2, column_name3...)
      FROM 'C:\Users\jafon\Documents\PythonMaterials\Data\AirBnB_Listings\listings.csv' 
      WITH DELIMITER ',' csv HEADER;
      ```
    
b. __Import Data into newly created table:__
<br><br>
(Under Browser): Database - Schemas - public - Tables (right click) -> Create -> Table
 - Name the Table (something different than the create Table under the query)
 - Under Columns - populate the column names by clicking on the dropdown, selecting the table you just created via the query (or I guess you could manually write out the columns here - You can skip step 1 if you do this)
 - Click save and create the table 
 - Access this newly table under the browser -> (right click) -> Import/Export -> Choose Impport
 - Select location of dataset file
 - Header YES or ON, DELIMITER ','
 - Save and Import

***
***

### POTENTIAL ERRORS TO LOADING DATA (and their solutions):

- ___"There is no such file or directory"___ or ___"permission denied":___
     - There is a permission error from Windows blocking pgAdmin from accessing the file folder
     - Right-click on the folder that contains the desired file -> Properties -> Change user permissions
        <br><br>    
- ___"extra data after last expected column":___
     - The number of columns being imported does not match up with the number of columns listed in the `COPY table_name(...)` query<br><br>
    - This addresses an important point of data loading for PostgreSQL, __IMPORTANT!!!!:__ You MUST import ***ALL*** of the columns from the csv; you cannot pick and choose!
    
      - There are two ways to fix this: <br>
      1. Deleting unnecessary columns in the original csv dataset - saving a new copy and loading from there
          - This is called "preprocessing" the data - and it is the easiest way
      2. Import ALL columns FIRST from csv, THEN modify the table
          - a. 
          ```SQL 
          ALTER TABLE table_Name DROP COLUMN column5
          ALTER TABLE table_Name DROP COLUMN column2 (etc.)
          ```
          - b. This may be too process-heavy/cumbersome for super large datasets
              - You can skip this by creating and intermediary table AND THEN picking and choosing from there: <br>
              ```SQL
              CREATE temporary table t (x1 integer, ... , x10 text)
              -- Copy from the file into it:
              COPY t (x1, ... , x10)
              FROM '/path/to/my_file'
              WITH  (format csv)
              
              INSERT INTO my_table (x2, x5, x7, x10)
              SELECT x2, x5, x7, x10
              FROM t
              
              DROP TABLE t;
              ```   
              
__NOTE!!!: This is a good method for re-ordering columns too!__
<br><br>
Overall,
<br><br>
The failure to easily choose column order and modify tables is a severe limitation of postgreSQL/pgAdmin. Other sql databse programs (e.g., MySQL database(s)) allow you to pick and choose columns normally.

## C. TABLE CREATION - THE MAIN WAY TO DO BUSINESS!

Instead of importing data from an existing table, we can alternatively create own table! ___However,___ in doing so, we need to do more than just set dimensions and input values. We need to name _everything_, set data types, add constraints if necessary, and of course, do it all without getting errors!<br><br>

Below is an example of a simple table creation. Keep in mind this only creates the table - it does not have any values inputted into the newly created table.

```SQL
CREATE TABLE table_name (
    some_column_name TYPE column_constraint,
    column_2_name TYPE, 
    column_3_name TYPE column constraint
    );
```

### What is TYPE?

__TYPE__ is the defined data type of the values within that column - yes, all values within the same column MUST be the same data type (unless you define it as "VarChar" (variable characters), which is unadvised and should only be used (1) as a placeholder or (2) if the data type isn't important for that column and want to avoid errors during importing). 
<br><br>
Examples of type are: 
- TEXT 
- INTEGER 
- NUMERIC 
- VARCHAR(100) _(number of max characters, regardless of type)_
- DATE. 
    - Check the internet for more data types!

#### Two Notes on VARCHAR(x)...

1. VARCHAR is a good placeholder, but unless you plan on _not_ performing any querying operations on that column that require a certain data type (numerical operations, DATE-time operations, etc.), you should go with a more specific datatype
    - One good reason to use VARCHAR is to avoid type-specific errors during importation of the data...which will LIKELY happen for data that is not 100% clean (which is always the case)!!!!!
<br>

2. SQL cannot handle arrays - it mimics the conceptual formatting of csv data (which is not in arrays). _Sometimes_, VARCHAR data may be interpreted as an array for SQL, which will invariably trigger an error! If this happens, choose a different data format, or preprocess the data to steer away from arrays.

***

### What are Constraints?

A `column_constraint` can be:<br><br>
1. A __boolean__ (constrain by "true", "false", or "null" values). Two examples:
    - `price numeric CHECK (price > 0)` ---- (for 'checking' positive prices)
    - (Can be multiple booleans, with a final "CHECK" not corresponding to any one particular column):<br>

```SQL
price numeric CHECK (price > 0), 
discounted_price numeric CHECK (discounted_price > 0), 
CHECK (price > discounted_price);
```

***    
2. __NOT NULL__ (constrain by only non-null's)
    - Example:
```SQL
name text NOT NULL,
price numeric NOT NULL CHECK (price > 0) 
```

    - The second example can also be defined in a query, such as:
    ```SQL
    select * from calendar
    where price is not null
    order by 4 DESC;
    ```
***
3. __UNIQUE__ (constrain by no duplicate values within that column)
    - Example: `product_no integer UNIQUE`

    - Can also combine uniques, such as making sure there are no _combinations_ of "a _and_ c values". This means that for row values for columns a and c: <br>
    12 24 (1) <br>
    12 12 (2) <br>
    12 24 (3) <br>
    22 24 (4) <br>
    Row (3) would be taken out, and all other rows would be kept.
<br>
***
4. __PRIMARY KEY__ (equivalent to UNIQUE + NOT NULL on a column)
    - can also do PRIMARY KEY (a, c) too
<br><br>
Check the internet for the other constraints that can be done!
***
***

### Adding Data to a Newly Created Table

Two Ways:<br>
1. Load an entire dataset into the table. _See_ Section I.B.b., _supra_, for more information on how to do that.
2. Manually entering in the data. We can do this via the `INSERT INTO` call! <br> 
__Example__:
```SQL
insert into cd.facilities -- table name (the "FROM" name)
    (facid, name, membercost, guestcost, initialoutlay, monthlymaintenance) -- The columns to insert 
    values -- (You don't need the above column name line if adding values to all columns in order...)
        (9, 'Spa', 20, 30, 100000, 800),
        (10, 'Squash Court 2', 3.5, 17.5, 5000, 80); -- Two rows of data are added here. Add as many as you like, which will be appended to the cd.facilities table ***in order*** of the rows listed!!!
```

For modifying/overwriting and deleting data, see __"Data Update"__ section.

## Altering an Already Created Table

__IMPORTANT!:__ <br>
Once a table is created, the order of the columns CANNOT be modified. What you _can_ do is rename all of the columns before populating with data by right clicking on each column and modifying until you are satisfied with the order...

### How to Alter Columns

__Answer:__ The `ALTER TABLE` call
```SQL
ALTER TABLE table_name
ALTER COLUMN column_name TYPE new_desiredcolumn -- (and new_desired type, if necessary)
```

If that doesn't work, do this
```SQL
ALTER TABLE table_name
ALTER COLUMN column_name TYPE new_desiredcolumn type
USING column_name::new_desired column type
```

Example:
```SQL 
ALTER TABLE calendar
ALTER COLUMN price TYPE MONEY NOT NULL
USING price::MONEY
```

***
***
# II. QUERYING TOOLS & SYNTAX

The heart and soul of SQL; otherwise, it would be called "Structured Just-Kinda'-Looking-At-The-Data Language", which doesn't have the same kind of ring and pithiness as does "Structured Querying Language".<br>

### SECTION CONTENTS:
1. Basic Searching & Selection
2. Working with Strings
3. "Case When" Statements
4. Aggregation/Grouping and Subquerying
5. Joins and CTEs
6. Modifying Data

## 1. Basics of Querying: Searching & Selection

This is a mile high overview example of what the format of a basic search - i.e., a search with no grouping, no joins, and no subquerying from a single data table - would look like:

```SQL
SELECT -- what you want to select
    column1,
    column5,
    column4 AS newcolumnname -- you can rename stuff (see II.1.A. infra)
FROM datatablename -- i.e., the source of the columns. If they are located in another table, you ***need*** to do a JOIN
WHERE 
    column5 > 0 -- limiting boolean(s) applied to the ***entire*** table output
    AND
    column4 > 0
    OR 
    (column5 < 0 AND column4 < 0)
    
ORDER BY column5 DESC -- Organizing the data by column data, and the direction of the order
LIMIT 10; -- Limiting output of query to number of lines
```

### Miscellaneous Notes Before We Jump In

- __How to Comment in SQL__ 
    - If you haven't figured it out, a double dash ('--') adds a comment into the query. 
    - As any programmer will tell you, __COMMENTING IS KEY. COMMENTING IS reQUIRED.__ <br><br>
- __How to Format SQL Code__
    - The line breaks, capitalization, spacing, and indentation of the query is __ALL__ stylistic - it won't cause an error during compilation if you ignore these things (you can even do the above query all in one line!). The purpose of all these things is for ease of reading.
        - The indentation and formatting presented here is typical SQL formatting (well..._I_ like to think it's pretty legit...).
        - The optional capitalization also applies to names of things to which you are referring as well as the SQL commands.
    - The terminal semicolon is also a relic adopted from other programming languages to signal the end of the query. Echoing the previous bullet, it is optional.

### A. SELECT

Using "SELECT" is often the first thing you want to do. You "select" which columns you would like to output from the query, with each column separated by a comma (listing "things" in a series in SQL requires commas, or else you'll get an error!). 
- __The order of the SELECT is important!!!__ What is outputted is a table with the columns in the order in which you listed.
- If you want to select the entire dataset, you use a asterisk (\*), such as `SELECT * FROM datatable1`. <br>
<br>
You can also manipulate what you are selecting in line: <br>

```SQL
SELECT
    column1 AS Total_View,
    column2 * 1.06, -- Yes, you can do any arithmetical operations in line in SQL!
    column5 * column 7 AS Total_Revenue
FROM 
    datatablename1;
```

As you can see, the selected data can be manipulated to output something different, such as a dual-column multiplication to output a column of the multiplication result. Sometimes, you will want to manipulate data based on data _already_ manipulated. To do this two-step manipulation process, we will need to do a ___subquery___ and then select from that. _See_ Section II.4.----, _infra_.
- This two-step concept is also used for joining multiple tables - you do a "sub-join" (whose result is a "Common Table Expression", _see_ Section II.5, _infra_), and then join a third table to that.

***

#### Sidenote: What is 'AS'???

The `AS` call is used to ___rename___ _any_ data object, whether it be a column name, table name (though not advised), or to assign a name to a full conditional/loop, subquery, or CTE. If renaming a column, the new name will appear in the query output.
- Using the word 'AS' in the query is optional. The query would produce the same result for column1 if it was just `column1 Total_View`.
- If you want multiple words as the new name, you need double quotes: `column1 AS "Total View"`. _See_ II.2., _infra_ for more information on the syntax of strings.
- If `column5*column7` was not renamed, the output name would be..."Column5\*Column7". Ugly.
    - The name of column2 here is _not_ changed because column2 is clearly the thing being selected, whereas it is ambiguous with two columns multiplied together
<br><br>

### B. WHERE

### C. ORDER BY

### D. LIMIT

## 2. WORKING WITH STRINGS IN SQL

Strings use single quotes ' '
Exception: AS uses double quotes (""). Why the difference, idk.

## 3. CASE WHEN STATEMENTS

## 4. AGGREGATION, GROUPING, & SUBQUERYING

## 5. JOINS AND COMMON TABLE EXPRESSIONS ("CTEs")

## 5. MODIFYING OR UPDATING EXISTING DATA

In [ ]:

1. SELECT _____ FROM _____;

# Select often the first thing to do, unless doing FROM (thing), SELECT...
# first space is what you want to look at, i.e., Column names
# Use SELECT * if you want to look at whole table
# second space is name of SQL file you want to look at
#semicolon at end doesn't do anything - just conventional
# example:
     SELECT temperature, clouds_and_sun FROM weather;
    
# while both can be syntactically accepted, 
# it is convention to do multiple rows

SELECT
    *
FROM
    stations;
    
# Can also change column names

SELECT
    temperature temp
FROM
    weather;
# can also do temperature AS temp (but typing the word AS is unnecessary)

2. WHERE
# purpose = can filter upon boolean conditions

# a.  use BETWEEN for ranges:
a BETWEEN x AND y # equivalent to a >= x AND a <= y
a NOT BETWEEN x AND y # equivalent to a < x OR a > y

# b.  use LIKE for matching strings:
"abc" LIKE "abc"    true
'abc' LIKE 'a%'     true # % = matches any preceding or following sequence of
                         # 0 or more characters
'abc' LIKE '_b_'    true # _ = matches any single character
'abc' LIKE 'c'      false
# b. use SIMILAR TO for string matching via regular expressions
# regex in a different noteset...

3. ORDER BY
# purpose = applies order of values

4. LIMIT
# purpose = returns set maximum number of values, e.g., "three longest trips"
# good to do generally if your computer is having a difficult time loading a 
# dataset, e.g., use LIMIT 10000;
SELECT
    trip_id,
    start_date,
    duration
FROM
    trips
WHERE
    bike_id = 27,
    zip_code = 94107 AND
    subscriber_type LIKE "Customer" #always double quotes in SQL
ORDER BY duration DESC,
start_date ASC # can order columns sequentially, i.e., if the duration column has duplicates, go to start_date to sort
LIMIT 3;

In [ ]:
# for reference - not a note!
COPY listings(name, host_name, neighbourhood, latitude, longitude, room_type, price, 
reviews_per_month, availability_365, lastreview, host_count, id, hostid, 
numberofreviews, minimumnights)
from 'C:\Users\jafon\Documents\PythonMaterials\Data\AirBnB_Listings\listings.csv' with delimiter ',' csv header;

## AGGREGATING AND GROUPING

In [ ]:
# AGGREGATING means can be done via similar NumPy methods
SELECT
    city, 
    AVG(lat) AS latitude,
    AVG(long) AS longitude,
    MAX(time),
    COUNT(*) AS station_count
FROM
    stations;
    
#GROUPING gets rids of duplicates, similar to UNIQUE in creating a table
SELECT
    city, 
    lat AS latitude,
    long AS longitude,
    MAX(time),
    COUNT(*) AS station_count
FROM
    stations
GROUP BY 1, 2, 3; # grouping by city, latitude, and longitude. 
# Can write out names of grouping columns too, but numbers are easier
# NOTE***: Cannot group aggregated columns (as there is now only a 
# single value for that column)
# NOTE***: THEREFORE, must group ALL OTHER columns!!!

## JOINS

In [ ]:
# JOINS join MULTIPLE TABLES together
# In this instance, MUST identify the table from which a specific column comes from
SELECT
    trips.trip_id,
    trips.start_station,
    stations.lat,
    stations.long
FROM
    trips 
JOIN
    stations
ON
    trips.start_station = stations.name; # where to do the join
# note that the values of the two ONs ***MUST BE THE SAME TO DO THE JOIN***
# (the column names need not be the same - just the values of those columns)
# See example in CTEs below on how to get around this (do multiple joins across tables)
    
# Can also use "aliases" to shorten table names. The above is the same as:
SELECT
    t.trip_id,
    t.start_station,
    s.lat,
    s.long
FROM
    trips t
JOIN
    stations s
ON
    t.start_station = s.name;
    
# TYPES OF JOINS
1. INNER JOIN  - returns only matching columns, dropping everything else 
# SQL default^^^, i.e., same as JOIN
2. OUTER JOIN - returns everything, leaving non-matches as null values
# not recommended, as may choke up computer when viewing large databases
3. LEFT JOIN - returns everything on left table, leaves non-matches on 
right table as null values
4. RIGHT JOIN - returns everything on right table, leaves non-matches on 
left table as null values
# more difficult to read since we read left to right - 
# better to flip around the tables in the query and do a left join instead

## COMMON TABLE EXPRESSIONS (CTEs)

In [ ]:
# CTE is joining a table on a previously processed query,
# (as opposed to joining two tables)

# Important to do because aggregation functions happen AFTER joins occur

CTE = WITH 
    Name of CTE to refer to later
AS (
    first query
)
SELECT
    second query
);

# EXAMPLE to break down:
WITH
    locations
AS (
    -- A simple query to get the averages of lat and long on a city level.
    SELECT
        city,
        AVG(lat) lat,
        AVG(long) long
    FROM
        stations
    GROUP BY 1
)

-- Joining the locations table we created with the trips table to count trips.
SELECT
    l.city,
    l.lat,
    l.long,
    COUNT(*)
FROM
    locations l

-- We need an intermediate join to go from locations to stations 
-- because the trips table does not have a "city" column.
JOIN
    stations s
ON
    l.city = s.city
JOIN
    trips t
ON
    t.start_station = s.name
GROUP BY 1,2,3;

# BREAKDOWN OF EXAMPLE:
'''
Under *locations*, after finding the averages of lat and long coordinates
for the stations of every city,
I want to join those values onto trips table.
HOWEVER, because trips table does not have a city name column,
I must join locations.city onto stations.city,
THEN DO A SECOND JOIN of trips.start_station onto stations.name.

Then, due to an inner join, the cities will be grouped with the averages of 
the coordinates, i.e., averages of lat, long, and count of number of trips
per city will be outputted.

'''

## CASE WHEN

In [ ]:
# Similar to WHERE - Allows for manipulation of values within a NEW column
CASE WHEN _condition_ THEN _value1_ ELSE _value2_ END AS _new_column_name_

# example:
SELECT
    (CASE WHEN dockcount > 20 THEN 'large' ELSE 'small' END) station_size,
    COUNT(*) as station_count
FROM 
    stations
GROUP BY 1;
'''
station_size is a new column, yielding *large* or *small* values based on
the dockcount, and the query is grouped by large and small.
'''
# Can do multiple conditions too:
SELECT player_name,
       weight,
       CASE WHEN weight > 250 THEN 'over 250'
            WHEN weight > 200 THEN '201-250'
            WHEN weight > 175 THEN '176-200'
            ELSE '175 or under' END AS weight_group
FROM benn.college_football_players
# don't need to do BETWEENs since the query is analyzed top-down!
# May still want to do that for clarity purposes...

In [ ]:
# for project

CREATE TABLE listings (
    id BIGINT,
    name TEXT,
    host_id BIGINT,
    host_name TEXT,
    neighbourhood_group TEXT,
    neighbourhood TEXT,
    latitude TEXT,
    longitude TEXT,
    room_type TEXT,
    price REAL,
    minimum_nights INTEGER,
    number_of_reviews INTEGER,
    last_review DATE,
    reviews_per_month REAl,
    calculated_host_listings_count INTEGER,
    availability_365 TEXT
);

CREATE TABLE calendar (
	listing_id BIGINT,
	calender_date DATE,
	available CHAR,
	price TEXT
);

CREATE TABLE reviews (
	listing_id BIGINT,
	id BIGINT,
	review_date DATE,
	reviewer_id BIGINT,
	reviewer_name TEXT,
	comments TEXT
);

CREATE TABLE listingstest (
    id VARCHAR(100),
    name VARCHAR(100),
    host_id VARCHAR(100),
    host_name VARCHAR(100),
    neighbourhood VARCHAR(100),
    latitude VARCHAR(100),
    longitude VARCHAR(100),
    room_type VARCHAR(100),
    price VARCHAR(100),
    minimum_nights VARCHAR(100),
	availability_365 VARCHAR(100),
    number_of_reviews VARCHAR(100),
    last_review VARCHAR(100),
    calculated_host_listings_count VARCHAR(100),
	reviews_per_month VARCHAR(100)
	);

code for thinkful project:

1. What is the most expensive listing? What else can you tell me about the listing?

select * from listingstest
order by price DESC
limit 5

ANSWER: The most expensive listing in San Francisco is priced at $9,999 per night. Called a "Test Apartment", it is an entire
apartment  in the Russian Hill neighborhood. It requires a 30-day minimum stay and is available about half the year. According to the number of reviews (zero), no one has taken advantage of this listing.

2. What neighborhoods seem to be the most popular?

select
neighbourhood,
avg(number_of_reviews) as numrev,
avg(reviews_per_month) as revrate 
from listingstest
where reviews_per_month is not null
group by neighbourhood
order by 3 desc;

ANSWER: The 10 most popular neighborhoods, in order from most popular, are: Presidio, Visitacion Valley, Outer Sunset, Parkside, Outer Richmond, Diamond Heights, Bayview, Ocean View, Excelsior, and Crocker Amazon. Because there was no transactional metric for usage and therefore popularity, popularity was instead determined by the highest average of reviews submitted per month.

 3. What time of year is the cheapest time to go to your city? What about the busiest?

ANSWER 3a:

select calender_date, avg(price) as avgprice 
from calendar
group by 1
order by 2 asc
limit 50;

ANSWER 3a: Out of the top 50 hits for the dataset time period of Dec. 2018 to Dec. 2019, 
all but 6 hits were in March and April. 5 of the remaining six were in december and january (the last one being in May)

ANSWER 3b: 

SELECT 
DATE_TRUNC('month', calender_date) m,
--DATE_TRUNC is a great method for compiling timestamp type columns by desired field
--(in this case, by month)
COUNT(listing_id) AS count,
-- ^ representing the total count for that particular month
SUM(CASE WHEN available = 't' THEN 1 ELSE 0 END) AS tsum,
-- ^ representing the total occupied, or "taken", count for that particular month
SUM(CASE WHEN available = 'f' THEN 1 ELSE 0 END) AS fsum,
-- ^ representing the total available, or "free", count for that particular month
(SUM(CASE WHEN available = 't' THEN 1 ELSE 0 END) * 100.0 / count(listing_id)) AS tratio
-- Yes, you can perform arithmetic operations in PostgreSQL
-- Make sure, however, that you write out the ENTIRE operation;
-- You ***CANNOT*** use newly created columns as part of the operation
-- Also, for percentages, use "100.0" instead of "100" - 100 rounds to an integer while 
-- float gives you the decimals
from calendar
GROUP BY m
-- As a reminder, when grouping, ALWAYS make sure you are grouping by ALL
-- non-aggregated columns that are called.
ORDER BY tratio desc;

ANSWER 3b: I use a column "tratio" to help me determine on a ratio basis what the busiest time of the year is. According to that column, the busiest times of the year is the month of February. The next most busiest months are March, April, May, and January, in that order.

In [ ]:
CREATE TABLE calendar (
	listing_id BIGINT,
	calender_date DATE,
	available CHAR,
	price REAL
);

CREATE TABLE reviews (
	listing_id BIGINT,
	id BIGINT,
	review_date DATE,
	reviewer_id BIGINT,
	reviewer_name TEXT,
	comments TEXT
);

-- Note: the type values for listings that were recommended by Thinkful caused errors for me
-- while varying character is not what I was looking for, 
-- it was the only thing that helped me move forward with this assignment

CREATE TABLE listingstest (
    id VARCHAR(100),
    name VARCHAR(100),
    host_id VARCHAR(100),
    host_name VARCHAR(100),
    neighbourhood VARCHAR(100),
    latitude VARCHAR(100),
    longitude VARCHAR(100),
    room_type VARCHAR(100),
    price MONEY,
    minimum_nights VARCHAR(100),
	availability_365 VARCHAR(100),
    number_of_reviews VARCHAR(100),
    last_review VARCHAR(100),
    calculated_host_listings_count VARCHAR(100),
	reviews_per_month VARCHAR(100)
	);